// Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)
console.log('Вивести числа від 20 до 30 через пропуск використовуючи крок 0,5 (20 20,5 21 21,5….)');
let strOne = '';
for (let i = 20; i <= 30; i = i + 0.5) {
    strOne += (i+ ' ');

}
console.log(strOne);
console.log('');

// 2. Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів
console.log('Один долар коштує 40 гривень. Вивести дані з розрахунком вартості 10, 20, 30... 100 доларів');
let strTwo = '';
for (let i = 10; i <= 100; i = i + 10) {
    let cost = i*40;
    strTwo += (cost+ '  ');
}
console.log(strTwo);
console.log('');

// 3. Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N
console.log('Дано ціле число. Вивести всі цілі числа від 1 до 100, квадрат яких не перевищує числа N');
let numN = +prompt('Введіть ціле число','');
let strThree = '';
for (let i = 1; i<=100; i++) {
    if (Math.pow(i,2) < numN) {
        strThree += (i+ ' ');
    }
}
alert(strThree);
console.log(strThree);
console.log('');

// 4. Дано ціле число. З'ясувати, чи воно простим (простим називається число, більше ніж 1, які мають інших дільників крім 1 і себе).
console.log('Дано ціле число. З`ясувати, чи воно простим');
let numFour = +prompt('Введіть ціле число', '');
for (let i = 2; i < numFour; i++) {
    if (numFour % i == 0) {
        alert(`${numFour} складене`);
    } else {
        alert(`${numFour} просте`)
    }
    break;
}
console.log('');

// 5. Дано кілька. Визначити, чи можна одержати це число шляхом зведення числа 3 деякий ступінь. (Наприклад, числа 9, 81 можна отримати, а 13 - не можна)
let numFive = +prompt('Введіть ціле число', '');
while (numFive % 3 == 0) {
    numFive /= 3;
}
if (numFive == 1) {
    alert('Число можна одержати');
} else {
    alert('Число не можна одержати')
}